{
  "projects": [
    {
      "id": "1",
      "titre": "Format'IUT",
      "description": "Application web de gestion de stages et alternances",
      "categorie": "academique",
      "date": "Hiver 2023-2024",
      "technologies": [
        "PHP",
        "JavaScript",
        "MySQL"
      ],
      "presentation": [
        "Format'IUT est un projet de groupe qui a duré 5 mois, consistant à créer un site web dynamique complet avec de nombreuses fonctionnalités.",
        "Nous étions une équipe de 6 avec une gestion de projet Agile, et en plus d'être développeur, j'assurais la tâche de Product Owner (membre qui décide des tâches à prioriser pour satisfaire le client au mieux). Le site consiste à offrir une gestion pratique, intuitive et sécurisée des stages et alternances d'une école, côté étudiants mais aussi entreprise et enseignants.",
        "Il contient notamment une large base de données en MySQL, un serveur en PHP (modèle MVCS), un système gérant de multiples types d'utilisateurs différents avec des permissions spécifiques, du CSS natif responsive, et un système d'alertes (messages flash, mails) parmis d'autres technologies. Le projet a été réalisé en méthode SCRUM, avec une forte utilisation de Git pour s'organiser."
      ],
      "fonctionnalites": [
        "Inscription, connexion, mail d'oubli de mot de passe sécurisés",
        "Recherches avec filtres et tri",
        "Démarches administratives facilitées",
        "Import / Export de données en CSV"
      ],
      "image": "/projects/formatiut.png",
      "github": "https://github.com/Izoret/FormatIUT",
      "link": "https://webinfo.iutmontp.univ-montp2.fr/~fuertesn/devapplicationformatiut/web/controleurFrontal.php"
    },
    {
      "id": "2",
      "titre": "",
      "description": "",
      "categorie": "academique",
      "date": "Hiver 2023-2024",
      "technologies": [
        "React",
        "Firebase",
        "Material-UI"
      ],
      "presentation": [],
      "fonctionnalites": [
        "Gestion des cours et des modules",
        "Système de quiz interactifs",
        "Suivi de progression",
        "Chat en temps réel"
      ],
      "image": "/projects/lms.png",
      "github": "https://github.com/username/lms",
      "link": "https://demo-lms.example.com"
    },
    {
      "id": "3",
      "titre": "Autoreg",
      "description": "Développement d'un système d'automatisation de tâches",
      "categorie": "professionnel",
      "date": "Printemps 2024",
      "technologies": [
        "Python + Tkinter",
        "GitLab CI/CD",
        "LDAP",
        "Administration réseau"
      ],
      "presentation": [
        "Autoreg est un outil d'automatisation de tâches que j'ai réalisé pour le CINES, le centre de calcul le plus puissant de France.",
        "Cet outil possède un unique noyau moteur qui réalise les tâches à automatiser, mais l'utilisation de ce noyau se présente sous deux formes : une interface graphique pour utilisation manuelle, et une pipeline automatique CI/CD couplée à un script Bash qui va lancer lui-même l'application. Ces deux méthodes sont dues à plusieurs contraintes durant le développement qui m'ont poussées à réaliser une solution qui fonctionnerait dans tous les cas possibles.",
        "Au niveau de l'automatisation elle-même, elle consiste à réaliser des manipulations sur le serveur LDAP pour y enregistrer ou modifier des données, manipulations autrefois réalisées manuellement. Il y a également un système de requêtes HTTPS vers différents services ainsi que de la communication avec une base MySQL, mais le travail le plus conséquent était au niveau du LDAP."
      ],
      "fonctionnalites": [
        "Automatisation d'opérations LDAP",
        "Système de vérification, de sécurité et de logging",
        "Interface graphique simple",
        "Pipeline et jobs CI/CD"
      ],
      "image": "/projects/autoreg.png"
    },
    {
      "id": "4",
      "titre": "CRM pour Cabinet Médical",
      "description": "Système de gestion de relation client pour professionnels de santé",
      "categorie": "professionnel",
      "date": "Été 2023",
      "technologies": [
        "Vue.js",
        "Laravel",
        "MySQL"
      ],
      "presentation": [],
      "fonctionnalites": [
        "Gestion des rendez-vous",
        "Dossiers patients électroniques",
        "Facturation automatisée",
        "Rappels SMS/Email"
      ],
      "image": "/projects/medical-crm.png",
      "github": "https://github.com/username/medical-crm",
      "link": "https://demo-crm.example.com"
    },
    {
      "id": "5",
      "titre": "Adam",
      "description": "Bot d'intéractions utilisateur avec serveur IA",
      "categorie": "personnel",
      "date": "Automne 2024",
      "technologies": [
        "Modèles d'IA",
        "Python",
        "PyTorch",
        "Flask",
        "JavaScript",
        "Node.js"
      ],
      "presentation": [
        "Adam est un algorithme utilitaire que j'ai créé dans le contexte de bots Discord. La technologie utilisée ici est un serveur Node.js avec la librairie Discord.js.",
        "En plus de réagir aux commandes des utilisateurs, j'ai permis à Adam de créer des réponses à des prompts pour être plus qu'un simple bot déterministe. Pour cela, j'ai réalisé un serveur Flask utilisant PyTorch avec différents modèles d'IA fine-tunés par moi-même pour répondre au mieux aux utilisateurs.",
        "Cette expérience m'a permis d'accroître mes compétences en IA et en JavaScript, tout en fournissant un outil intéressant à différents serveurs Discord."
      ],
      "fonctionnalites": [
        "Serveur LLM pour répondre aux prompts",
        "Interface utilisateur simple",
        "Très facilement extensible pour l'ajout de commandes"
      ],
      "image": "/projects/adam.png",
      "github": "https://github.com/Izoret/Adam",
      "link": "https://discord.com/oauth2/authorize?client_id=1291689809005248542&scope=bot&permissions=1099511627775"
    },
    {
      "id": "6",
      "titre": "Revolve",
      "description": "Jeu vidéo de réflexion pour PC",
      "categorie": "personnel",
      "date": "Printemps 2023",
      "technologies": [
        "C#",
        "Unity"
      ],
      "presentation": [
        "Rev0lve est un jeu vidéo pour Linux que j'ai réalisé en solo dans mon temps libre, en approximativement 5 mois, basé sur le concept original de contrôler le niveau au lieu du personnage.",
        "J'ai réalisé ce jeu en 2D en me servant du moteur Unity. Tous les visuels sont dessinés en pixel art par moi-même, et les scripts sont écrits à la main, en C#, en suivant les paradigmes de la programmation objet. Le défi principal dans ce projet était de garder la discipline de travailler dessus sur mon temps libre malgré le fait que je n'avais ni équipe ni motivation financière derrière, c'était intégralement pour me former à des technologies et réaliser un produit fini.",
        "Il n'existe actuellement pas de démo publique car j'ai décidé de garder le concept pour le retravailler dans le futur avant de le rendre disponible."
      ],
      "fonctionnalites": [
        "Différents niveaux réfléchis différemment",
        "Analyse de l'expérience utilisateur"
      ],
      "image": "/projects/revolve.png",
      "github": "",
      "link": ""
    }
  ]
}